strlist = [
    '多元分析研究的是多指标问题的统计总体。',
    '协方差和相关系数仅仅是变量间离散程度的一种度量，并不能刻画变量间可能存在的关联程度关系',
    '在实际问题中,通常可以假定被研究的对象是多元正态分布 , 但分布中的参数μ和Σ是未知的,一般的做法是通过样本来估计。',
    '数理统计中常用的抽样分布卡方分布，在多元统计中,与之对应的分布为wishart分布',
    '多元统计研究的是多指标问题,为了了解总体的特征,通过对总体抽样得到代表总体的样本但因为信息是分散在每个样本上的,就需要对样本进行加工,把样本的信息浓缩到不包含未知量的样本函数中,这个函数称为统计量。',
    '多元数据的协方差阵检验中，需分析当前的波动幅度与过去的波动情形有无显著差异，此时要检验的假设H0为Σ=Σ_0',
    '多元数据协方差阵检验中，需要了解这多个总体之间的波动幅度有无明显的差异，此时要检验的假设的备择假设H1为Σ_i不全相等',
    '针对连续变量的统计推断方法中，最常用的有T检验和方差分析',
    '判别分析是判别样品所属类型的一种统计方法',
    '判别分析适用于被解释变量是非度量变量的情形。',
    '与其他多元线性统计模型类似，判别分析的假设之一是每一个判别变量（解释变量）不能是其他判别变量的线性组合，假设之二是各组变量的协方差矩阵相等，假设之三是各判别变量遵从多元正态分布。',
    'Q型聚类法是按样品进行聚类，R型聚类法是按变量进行聚类,9. Q型聚类相似度统计量是而R型聚类统计量通常采用相似系数',
    '聚类分析中，模糊聚类方法的基本思想是通过优化目标函数得到每个样本点对所有类中心的隶属度，从而对样本进行自动分类。',
    '主成分分析中我们所说的保留原始变量尽可能多的信息，也就是指的生成的较少的综合变量的方差和尽可能接近于原始变量方差的总和。',
    '在进行主成分分析得出协方差阵或是相关阵发现最小特征根接近于零时，意味着中心化以后的原始变量之间存在多重共线性，即原始变量存在着不可忽视的重叠信息。',
    '多元分析中常用的统计量有样本均值向量、样本协差阵、样本离差阵、样本相关系数矩阵。'
]

def get_str_list(str_list, specify_str):
    res = []
    for s in str_list:
        if specify_str in s:
            res.append(s)
    for i in res:
        print(i)

def find(str):
    get_str_list(strlist,str)